{
    "about_description": "From Paris to VSCode, I am a passionate Full Stack developer creating complete web applications, bringing my personal touch to both UI/UX and back-end architecture. Since 2021, I have been perfecting my skills in all aspects of web development. My passion for creativity and logical rigor naturally led me to Full Stack development, where I can leverage my technical expertise to build robust and attractive end-to-end applications. Moving forward, my goal is to gain in-depth expertise to lead a team of developers on complex projects.",
    "Home":"Home",
    "About":"About",
    "Projects":"Projects",
    "Contact":"Contact",
    "Probabilities":"Mathematic modeling",
    "Hover me":"Hover me",
    "Hi! I'm":"Hi! I'm",
    "Full Stack Developer":"Full Stack Developer",
    "card_container":"I am a web developer passionate about creating interactive online experiences",
    "Brief presentation":"Brief presentation",
    "but3":"BUT I.T (Apprenticeship) - I.U.T Villetaneuse",
    "levelUp":"During my internship as a Web Developer, I acquired skills in Project Management & Team Management, using tools like Notion, Slack and Wordpress",
    "datebut3":"Sept. 2024 to Sept. 2025",
    "Key Courses":"Key Courses",
    "datelevelUp":"From January to March 2024",
    "Administrer":"Administrate",
    "Réaliser":"Realize",
    "Optimiser":"Optimize",
    "Gérer":"Manage",
    "Conduire":"Lead",
    "devweb":"Web Application Development",
    "ia":"AI Model Creation",
    "virtua":"Virtualization",
    "SAESummary":"Team-based learning and assessment situation",
    "RealiserSummary":"Web & mobile development, real-world projects, JS frameworks, Python, Java.",
    "OptimiserSummary":"Algorithm optimization, performance management, data structures.",
    "AdministrerSummary":"Database management, network administration, security.",
    "GérerSummary":"Project management, communication, teamwork.",
    "ConduireSummary":"Project steering, automation, production deployment.",
    "prefecture_title": "Full Stack developer Apprenticeship at Préfecture de Police de Paris (DSPAP)",
    "prefecture_period": "From Sept. 2024 to Sept. 2025",
    "software_engineering": "Software Engineering",
    "requirements_analysis": "Requirements Analysis",
    "conception": "Conception",
    "tests": "Tests",
    "and": "and",
    "migration_php": "Migration from PHP 5.4 to",
    "symfony": "Symfony 6.4",
    "nuxt_typescript": "Nuxt + TypeScript",
    "development_of": "Development of a",
    "statistical_production": "statistical production web page",
    "web_page": "web page",
    "rest_api": "REST API development with",
    "api_platform": "API Platform",
    "communicating_with": "communicating with",
    "nuxt": "Nuxt",
    "levelup_title": "Internship at Level Up Tech Consulting",
  "levelup_period": "From January to March 2024",
  "during_internship": "During my internship, I acquired ",
  "skills": "skills",
  "in": "in",
  "project_management": "Project Management",
  "team_management": "Team Management",
  "using_tools": " using tools like Notion, Slack and Wordpress as a ",
  "web_developer": "Web Developer",
  
  "university_title": "Destination : University",
  "university_period": "2021-2022 & 2022-2023",
  "first_year": "First year of Bachelor's degree in ",
  "computer_science": "Computer Science",
  "at_sorbonne": " at Sorbonne University in Villetaneuse",
  "linkedinChatbot": "See more on this video!",

  "highschool_title": "Destination : High school",
  "highschool_period": "2018-2021",
  "during_highschool": "During high school, I studied ",
  "extensively_engaging": " extensively, engaging in various activities such as ",
  "building_pc": "building my own PC",
  "creating": " creating ",
  "media_edits": "video/photo edits",
  "troubleshooting_however": " & troubleshooting. However, there was still one area I hadn't ventured into: coding ",
  "coding": "coding",
  "Academic Experience":"Academic Experience",
  "Professional Experience":"Professional Experience",
  "Discover me":"Discover me",
  "Contact me":"Contact me",
  "Skills":"Skills",
  "My work":"My work",
  "More details":"More details",
  "Want to discuss ?":"Want to discuss ?",
  "Age & gender classiffication (CNN)":"Age & gender classiffication (CNN)",
  "One month":"One month",
  "Group work":"Group work",
  "Zoom-in":"Zoom-in",
  "Qualoto_description":"Qualoto is a web application developed at the end of 2024 as a university project that allows users to participate in a virtual lottery game. The game is designed to be accessible to all players, with an emphasis on development quality standards. The application is built using Django, a popular Python framework for creating Full Stack applications, along with other technologies such as Tailwind CSS and MySQL for the database. This project allowed me to adopt a conceptual approach, which helped me develop a deep understanding of the technologies used and better comprehend the different stages of web application development.",
  "Github":"View on GitHub",
  "Features":"Features",
  "Authentication":"Authentication",
  "Grid choice":"Grid choice",
  "Player list":"Player list",
  "Draw":"Draw",
  "Ranking":"Ranking",
  "Authentication_title":"An authentication system for tracking progress",
  "Authentication_description":"At Qualoto, players begin by registering with a unique username. The system enforces strict validation—rejecting duplicates or empty entries (even those with only spaces) and returning descriptive error messages in JSON. Once registered, each player receives a ticket that records their draw participation, including draw date and chosen numbers, ensuring secure and traceable access throughout the game.",
  "Draw_title":"A drawing system with real players or bots",
  "Draw_description":"Qualoto features a dynamic drawing system where real players and randomized bots receive lottery numbers. When a draw is initiated, every participant is assigned a ticket containing their main and bonus numbers. A dedicated form lets players manually select their numbers or use a “Flash” option for random generation. The system then simulates the draw, ensuring fair assignment of numbers and adherence to the game’s strict rules.",
  "Ranking_title":"A ranking system with an equitable prize distribution algorithm",
  "Ranking_description":"After each lottery draw, Qualoto computes a ranking to identify the top winners. The ranking algorithm compares players’ tickets with the drawn numbers—regardless of order—and allocates prizes based on predefined percentage distributions (e.g., 40%, 20%, etc.). In cases where players share identical winning numbers, the system fairly splits the prize percentage between them, ensuring an equitable distribution of gains. This robust ranking process guarantees transparency and fairness in every draw.",

  "performvision_description": "Perform Vision is an intranet site developed as part of my training at I.U.T De Villetaneuse. The objective was to create, with the help of my 4 teammates, a time and material service site allowing the management of delivery notes.",
  "Five months":"Five months",
"Three months":"Three months",
"Two months":"Two months",

 "performvision": {
          "role": {
            "title": "Roles",
            "description": "As a manager and administrator, these roles can add different members such as: service providers, contacts, sales representatives, and clients."
          },
          "client": {
            "title": "Create a client",
            "description": "We can also create a client by providing their contact details as well as assigning the client to one or more sales representatives."
          },
          "deliveryNote": {
            "title": "Delivery Note",
            "description": "The primary objective is to be able to create delivery notes per month, with different periods: Day, Half-day, and Time slots. The half-day must be indicated by the morning or evening period, while the time slot must be specified between a departure and arrival time."
          },
          "history": {
            "title": "Delivery Note History",
            "description": "To analyze delivery notes effectively, it is necessary to have a history of the latest delivery notes where we can view the delivery notes over the course of the month."
          }
        },
 
  "skills_card": {
    "react": {
        "title": "React",
        "description": "Self-taught React developer focusing on building interactive user interfaces with reusable components and optimized state management"
    },
    "tailwind": {
        "title": "Tailwind CSS",
        "description": "Leveraging Tailwind CSS since 2022 to create efficient, responsive designs with a streamlined development workflow"
    },
    "Proactif": {
        "title": "Proactive",
        "description": "Ability to anticipate needs and take proactive steps to address issues before they arise"
    },
    "php": {
        "title": "PHP",
        "description": "Strong expertise in PHP for backend development with experience in creating robust server-side applications and APIs"
    },
    "teamwork": {
            "description": "Effective collaboration within multidisciplinary teams to achieve common goals and deliver quality projects"
        },
    "postgresql": {
        "title": "PostgreSQL",
        "description": "Experienced in PostgreSQL database design and optimization, leveraging advanced features for complex data management solutions"
    },
    "Autodidacte": {
        "title": "Autodidacte",
        "description": "Self-taught developer with a strong ability to learn new technologies and frameworks quickly"
    },
    "nuxt": {
        "title": "Nuxt",
        "description": "Expanding my Vue.js expertise with Nuxt to create optimized, SEO-friendly applications with server-side rendering capabilities"
    },
    "symfony": {
        "title": "Symfony",
        "description": "Specialized in Symfony framework for building structured, maintainable PHP applications with a focus on best practices and security"
    },
    "docker": {
        "title": "Docker",
        "description": "Implementing Docker for containerized development and deployment workflows, ensuring consistent environments across development and production"
    }
},

    "cnn": {
      "overview": {
        "title": "Project Overview",
        "description": "This project uses the UTKFace dataset to train Convolutional Neural Networks (CNNs) for age and gender classification. The dataset covers diverse facial images, enabling robust model performance."
      },
      "goal": {
        "title": "Goal & Approach",
        "description": "The aim is to accurately predict both age and gender from a single image. Iterative refinements focus on boosting accuracy while ensuring efficient deployment."
      },
      "fullstack": {
        "title": "Full Stack with Gradio",
        "description": "A Gradio interface was developed for a smooth user experience, reinforcing my full stack skills in front-end design and back-end integration."
      },
      "future": {
        "title": "Future Improvements",
        "description": "Possible enhancements include real-time video inference, additional facial attributes (e.g., expression), and scaling for higher traffic."
      },
       "content": {
            "section1": {
              "title": "Data Distribution Visualizations",
              "description": "Presentation of gender balance and age distribution in the UTKFace dataset.",
              "alt1": "Distribution Chart 1",
              "alt2": "Distribution Chart 2"
            },
            "section2": {
              "title": "Error Analysis and Scatter Plots",
              "description": "These charts illustrate prediction errors and compare predicted values with actual values.",
              "alt1": "Error Distribution",
              "alt2": "Age Prediction Validation"
            },
            "section3": {
              "title": "Prediction Examples",
              "description": "Real-world inference on image examples for age and gender prediction.",
              "alt1": "Face Example 1",
              "alt2": "Face Example 2"
            }
          }
    },

     "medicial": {
        "overview": {
          "title": "Project Overview",
          "description": "This chatbot aims to provide accurate answers to questions about schizophrenia in general, a specialization that is very underdeveloped within technological innovation."
        },
        "goal": {
          "title": "Goal & Approach",
          "description": "The goal is to provide reliable and accessible information about schizophrenia, using advanced natural language processing techniques like RAG."
        },
        "fullstack": {
          "title": "Full Stack with React, MongoDB, and FastAPI",
          "description": "This project uses a full stack architecture, combining React for the front-end, MongoDB for the database, and FastAPI for the back-end."
        },
        "future": {
          "title": "Future Improvements",
          "description": "Possible enhancements include real-time audio transcription, as well as image import for analysis purposes."
        },
        "content": {
            "section1": {
              "title": "Data Distribution Visualizations",
              "description": "Presentation of gender balance and age distribution in the UTKFace dataset.",
              "alt1": "Distribution Chart 1",
              "alt2": "Distribution Chart 2"
            },
            "section2": {
              "title": "Error Analysis and Scatter Plots",
              "description": "These charts illustrate prediction errors and compare predicted values with actual values.",
              "alt1": "Error Distribution",
              "alt2": "Age Prediction Validation"
            },
            "section3": {
              "title": "Prediction Examples",
              "description": "Real-world inference on image examples for age and gender prediction.",
              "alt1": "Face Example 1",
              "alt2": "Face Example 2"
            }
          }
      },
      
    

    "netcards": {
        "description": "NetCards is an engaging online flashcard platform that I developed for effective learning and knowledge retention. The platform provides a dynamic and interactive way for users to create, share, and study digital flashcards on various subjects. Users can easily customize their decks, incorporating multimedia elements like images and audio, to enhance the learning experience.",
        "demo": "View a demo",
        "deck": {
            "title": "Deck system",
            "description": "The deck system empowers users to effortlessly create, organize, and study their personalized flashcards, fostering a dynamic learning environment tailored to individual needs and preferences.",
            "imageAlt": "NetCards deck interface screenshot"
          },
          "auth": {
            "title": "Authentication system",
            "description": "An authentication system has been designed and deployed with the primary objective of enabling users to securely log in and access their personalized decks of flashcards. By incorporating this system, users can enjoy a seamless experience, tailored to their individual preferences and learning needs. Additionally, this authentication mechanism ensures the privacy and security of user data, fostering trust and reliability within the platform.",
            "imageAlt": "NetCards authentication screen"
          }
      },

      "todolist":{
        "description": "The purpose of creating a todo list was to practice assimilating React hooks (useEffect and useState) to understand their logic. Additionally, I love the concept of productivity, so creating projects like a todo list is just a joyous part of it.",
        "oneweek": "One week",
        "editTask": "Edit a Task",
        "checkDeleteTask": "Check & Delete a Task"
      }
      








}
